# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Tudor\Documents\PSoC Creator\Workspace03\Design01.cydsn\Design01.cyprj
# Date: Fri, 17 Dec 2021 17:22:21 GMT
#set_units -time ns
create_clock -name {I2C_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {CyRouted1} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyWCO} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/wco}]]
create_clock -name {CyLFClk} -period 30517.578125 -waveform {0 15258.7890625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyECO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/eco}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 11} [list]


# Component constraints for C:\Users\Tudor\Documents\PSoC Creator\Workspace03\Design01.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Tudor\Documents\PSoC Creator\Workspace03\Design01.cydsn\Design01.cyprj
# Date: Fri, 17 Dec 2021 17:22:19 GMT
